
//&НаКлиенте
//Процедура ВремяЧасыПриИзменении(Элемент)
//	Объект.ФактическиЗатраченовеВремя = Объект.Время.Итог("Часы");
//КонецПроцедуры

&НаКлиенте
Процедура ВремяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Дата) Тогда
		Элемент.ТекущиеДанные.Дата = ПолучитьДатуСеанса();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуСеанса();
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ГотовоПриИзменении(Элемент)
	Если Объект.Готово Тогда
		Объект.ФактическаяДатаСдачи = ПолучитьДатуСеанса();
		Если Не ЗначениеЗаполнено(Объект.ПланируемаяДатаСдачи) Тогда
			Объект.ПланируемаяДатаСдачи = Объект.ФактическаяДатаСдачи;
		КонецЕсли;		
	Иначе
		Объект.ФактическаяДатаСдачи = Неопределено;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Содержание = СокрЛП(Объект.Содержание);
	Если Не ЗначениеЗаполнено(Объект.Решение) Тогда
		Объект.Решение = СокрЛП(Объект.Решение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПриИзменении(Элемент)
	Объект.ФактическиЗатраченовеВремя = Объект.Время.Итог("Часы");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры
