
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.mITIL_ЗадачиУчетВремени.Записывать = Истина;
	Для Каждого ТекСтрокаВремя Из Время Цикл
		Движение = Движения.mITIL_ЗадачиУчетВремени.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Дата = ТекСтрокаВремя.Дата;
		Движение.Часы = ТекСтрокаВремя.Часы;
		Движение.Комментарий = ТекСтрокаВремя.Комментарий;
	КонецЦикла; 
	
КонецПроцедуры  

Процедура ПриКопировании(ОбъектКопирования)

	ВРаботе = Ложь;
	Готово  = Ложь;
	ДатаПоступления = Неопределено;
	ПланируемаяДатаСдачи = Неопределено;
	ФактическиЗатраченовеВремя = 0;
	ФактическаяДатаСдачи = Неопределено;
	Время.Очистить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

    Если ЗначениеЗаполнено(Исполнитель) Тогда
	
		Отбор = Новый Структура;
		Отбор.Вставить("Задача", Ссылка);
		Отбор.Вставить("Исполнитель", Исполнитель);
		Сведения = РегистрыСведений.mITIL_Исполнители.ПолучитьПоследнее(КонецДня(ТекущаяДата()), Отбор);	
		
		Если Истина Тогда
			
			МенеджерЗаписи = РегистрыСведений.mITIL_Исполнители.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Задача = Ссылка;
			МенеджерЗаписи.Исполнитель = Исполнитель;
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


