
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ЗадачиУчетВремени.Записывать = Истина;
	Для Каждого ТекСтрокаВремя Из Время Цикл
		Движение = Движения.ЗадачиУчетВремени.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Дата = ТекСтрокаВремя.Дата;
		Движение.Часы = ТекСтрокаВремя.Часы;
		Движение.Комментарий = ТекСтрокаВремя.Комментарий;
	КонецЦикла;
КонецПроцедуры  

Процедура ПриКопировании(ОбъектКопирования)
	ВРаботе = Ложь;
	Готово  = Ложь;
	ДатаПоступления = Неопределено;
	ПланируемаяДатаСдачи = Неопределено;
	ФактическиЗатраченовеВремя = 0;
	ФактическаяДатаСдачи = Неопределено;
	Время.Очистить();	
КонецПроцедуры


