
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПервыйЗапуск();	
	
КонецПроцедуры

Процедура ПервыйЗапуск() 
	
	Записи = РегистрыСведений.mITIL_ПраваПользователей.СоздатьНаборЗаписей();
	Записи.Прочитать();
	Если Записи.Количество() = 0 Тогда
		
		// Получаем ссылку на регистр сведений
		РегистрСведений = РегистрыСведений.mITIL_ПраваПользователей.СоздатьНаборЗаписей();
		
		// Создаем новую запись в регистре сведений
		НоваяЗапись = РегистрСведений.Добавить();
		
		// Заполняем значения записи
		НоваяЗапись.Дата = ТекущаяДатаСеанса();
		НоваяЗапись.Пользователь = Пользователи.ТекущийПользователь();
		НоваяЗапись.Право = Перечисления.mITIL_Права.mITIL_Администратор;
		
		// Сохраняем изменения в регистре сведений
		РегистрСведений.Записать();			
		
	КонецЕсли;
	
КонецПроцедуры
